In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('data/learn_pandas.csv')
df.head(10)

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
5,D,Freshman,Xiaoli Qian,Female,158.0,51.0,N,1,2019/10/31,0:03:47
6,A,Freshman,Qiang Chu,Female,162.5,52.0,N,1,2019/12/12,0:03:53
7,D,Junior,Gaoqiang Qian,Female,161.9,50.0,N,1,2019/9/3,0:03:45
8,D,Freshman,Changli Zhang,Female,163.0,48.0,N,1,2020/1/5,0:05:13
9,B,Junior,Juan Xu,Female,164.8,NaN,N,3,2019/10/5,0:04:05

In [7]:
df.groupby('School')[['Weight', 'Test_Number']]

df.groupby(['School', 'Gender'])['Weight'].mean()

df.groupby([df.Weight > df.Weight.mean()])['Weight'].mean()


item = np.random.choice(list('abc'), df.shape[0])

condition = df.Weight > df.Weight.mean()

df.groupby([condition, item])[['Weight']].mean()


#

NameError: name 'df' is not defined

In [96]:
# df['School'].drop_duplicates()
df.groupby([df['School'], df['Gender']])['Height'].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

In [41]:
np.random.seed(0)

df = pd.DataFrame(data=np.random.randint(0, 9, size=(6, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  5  0  3  3
1  7  3  5  2
2  4  7  6  8
3  8  1  6  7
4  7  8  1  5
5  8  4  3  0

In [101]:
gb = df.groupby(['A'])
gb.get_group(7).loc[4]

A    7
B    8
C    1
D    5
Name: 4, dtype: int64

In [42]:
df.groupby('A').sum()

    B  C  D
A
4   7  6  8
5   0  3  3
7  11  6  7
8   5  9  7

In [66]:
df.groupby('A').size()

A
4    1
5    1
7    2
8    2
dtype: int64

In [37]:
df.groupby('A').ngroups

2

In [46]:
df['A'].drop_duplicates()

0    5
1    7
2    4
3    8
Name: A, dtype: int64

In [62]:
pd.Series(list(df.groupby('A').indices.keys()))

0    4
1    5
2    7
3    8
dtype: int64